src/Documents/ЭлектронноеПисьмоИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмоИсходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщенияОтправкаIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Comment>Текстовое описание отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработатьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейСкрытыхКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИсходящегоЭлектронногоПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПисьма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкрытыхКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепринятыеВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПисьмаВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Письмо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерВоВложениях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЖурналРегистрацииТриггерныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииТриггерныхСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SMSРассылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРегистрацииСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Сообщение о коллизии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияПоПодписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВариантыВажностиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЭлектронноеПисьмоИсходящее/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Предмет") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.Предмет) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
				ИЛИ ТипЗнч(ДанныеЗаполнения.Предмет) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
				// Вводится ответ на входящее электронное письмо
				
				ЗаполнитьНаОснованииВходящегоПисьма(ДанныеЗаполнения.Предмет, ДанныеЗаполнения.Команда);
				
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.Предмет) = Тип("СправочникСсылка.Контрагенты") Тогда
				
				ОснованиеКонтрагент = ДанныеЗаполнения.Предмет;
				Предмет 			= ДанныеЗаполнения.Предмет;
				
				Если ЗначениеЗаполнено(ОснованиеКонтрагент) Тогда
					
					ЭлектронныйАдресКлиента = ПолучитьАдресПочтыКонтрагента(ОснованиеКонтрагент);
					
					СтрокаТаблицыПолучателей = ПолучателиПисьма.Добавить();
					
					СтрокаТаблицыПолучателей.Контакт       = ОснованиеКонтрагент;
					СтрокаТаблицыПолучателей.Представление = ОснованиеКонтрагент.Наименование;
					
					Если НЕ ЭлектронныйАдресКлиента = "" Тогда
						СтрокаТаблицыПолучателей.Адрес	= ЭлектронныйАдресКлиента;
						СписокПолучателейПисьма			= ОснованиеКонтрагент.Наименование + " <" + ЭлектронныйАдресКлиента + ">";
					Иначе
						СписокПолучателейПисьма			= ОснованиеКонтрагент.Наименование + " <>";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
		Если ДанныеЗаполнения.Свойство("ТекущаяУчетнаяЗапись") Тогда
			
			УчетнаяЗапись = ДанныеЗаполнения.ТекущаяУчетнаяЗапись;
			
		КонецЕсли;
			
		Если ДанныеЗаполнения.Свойство("ШаблонПисьма") Тогда
			
			Текст = "";	
			ТекстHTML = ДанныеЗаполнения.ШаблонПисьма.ТекстHTML;
			ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			
		КонецЕсли;
			
		Если ДанныеЗаполнения.Свойство("Тема") Тогда
			
			Тема = ДанныеЗаполнения.Тема;
			
		КонецЕсли;
		ЭтотОбъект.ТекстHTML     = ?(ДанныеЗаполнения.Свойство("Тело"), СтрЗаменить(ДанныеЗаполнения.Тело, Символы.ПС, "<br>"), ЭтотОбъект.ТекстHTML);
		ЭтотОбъект.Дата          = ?(ДанныеЗаполнения.Свойство("Дата"), ДанныеЗаполнения.Дата, ЭтотОбъект.Дата);

			
		Если ДанныеЗаполнения.Свойство("МассивПолучателей") Тогда
			
			МассивПолучателей = ДанныеЗаполнения.МассивПолучателей;
			
			// Очень важно чтобы вместе с массивом получателей передавался также массив адресов электронной почты.
			// Вариант работы без массива Email сделан для страховки и особых случаев.
			МассивEmail 	  = Неопределено;
			ДанныеЗаполнения.Свойство("МассивEmail", МассивEmail);
			
			Для Каждого Получатель Из МассивПолучателей Цикл
				
				Если ТипЗнч(Получатель) = Тип("Структура") Тогда 					
					
					НовыйПолучатель = ПолучателиПисьма.Добавить();
					НовыйПолучатель.Контакт       = Получатель.Контакт;
					НовыйПолучатель.Адрес         = Получатель.Адрес;
					НовыйПолучатель.Представление = Строка(Получатель.Контакт);
					
				ИначеЕсли ПолучателиПисьма.Найти(Получатель, "Контакт") = Неопределено Тогда
					
					НовыйПолучатель = ПолучателиПисьма.Добавить();
					НовыйПолучатель.Контакт = Получатель;
					НовыйПолучатель.Адрес	=?(МассивEmail = Неопределено,
												ПолучитьАдресПочтыКонтрагента(Получатель),
												МассивEmail.Получить(МассивПолучателей.Найти(Получатель)));
					НовыйПолучатель.Представление = Строка(Получатель);
					
				КонецЕсли;
				
			КонецЦикла;
			
			СписокПолучателейПисьма = УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(ПолучателиПисьма, Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Важность) Тогда
		Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;		
	
	СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Черновик;
	Если ПустаяСтрока(Кодировка) Тогда
		Кодировка = "utf-8";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	КонецЕсли;
	
	ОтправительПредставление = Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьПредставлениеДляУчетнойЗаписи(УчетнаяЗапись);  	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Справочники.Пользователи.ПустаяСсылка();
	СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Черновик;	
	ДатаОтправления = Неопределено;
	ИдентификаторСообщения = "";
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

//
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда
		ДополнительныеСвойства.ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации", ЭтотОбъект.Ссылка);
		РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ЗарегистрироватьСобытиеТриггера(ДополнительныеСвойства.ПараметрыРегистрацииТриггера);
	КонецЕсли;
	
	УправлениеЭлектроннойПочтой.УстановитьПометкуУдаленияУВложенийПисьма(Ссылка, ПометкаУдаления);
	
КонецПроцедуры

//
//
Процедура ПередУдалением(Отказ)
	
	УправлениеЭлектроннойПочтой.УдалитьВложенияУПисьма(Ссылка);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//
//
Процедура ЗаполнитьНаОснованииВходящегоПисьма(Основание, ТипОтвета)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ПереноситьОтправителя = Истина;
		ПереноситьВсехПолучателей = Ложь;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ПереноситьОтправителя = Ложь;
		ПереноситьВсехПолучателей = Истина;
	КонецЕсли;
	ПереноситьВложения = Ложь;
	ДобавлятьКТеме = "Re: ";
	
	Если ТипОтвета = "ОтветитьВсем" Тогда
		ПереноситьВсехПолучателей = Истина;
	ИначеЕсли ТипОтвета = "Переслать" Тогда
		ДобавлятьКТеме = "Fw: ";
		ПереноситьОтправителя = Ложь;
		ПереноситьВложения = Истина;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			ПереноситьВсехПолучателей = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПараметрыИзВходящегоПисьма(Основание, ПереноситьОтправителя, ПереноситьВсехПолучателей, ДобавлятьКТеме, ПереноситьВложения);
	
КонецПроцедуры

//
//
Процедура ДобавитьПолучателя(Адрес, Представление, Контакт)
	
	новСтр = ПолучателиПисьма.Добавить();
	новСтр.Адрес = Адрес;
	новСтр.Контакт = Контакт;
	новСтр.Представление = Представление;
	
КонецПроцедуры

//
//
Процедура ДобавитьПолучателейИзТаблицы(Таблица)
	
	Для Каждого Стр Из Таблица Цикл
		новСтр = ПолучателиПисьма.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Стр);
	КонецЦикла;
	
КонецПроцедуры

//
//
Процедура ЗаполнитьПараметрыИзВходящегоПисьма(Входящее, ПереноситьОтправителяВПолучатели, ПереноситьВсехПолучателейПисьмаВПолучатели, ДобавлятьКТеме, ПереноситьВложения)

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.ИдентификаторСообщения,
	|	ЭлектронноеПисьмоВходящее.ИдентификаторыОснований,
	|	ЭлектронноеПисьмоВходящее.Кодировка,";
	Если ТипЗнч(Входящее) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЭлектронноеПисьмоВходящее.ОтправительАдрес,
		|	ЭлектронноеПисьмоВходящее.ОтправительКонтакт,
		|	ЭлектронноеПисьмоВходящее.ОтправительПредставление,";
	ИначеЕсли ТипЗнч(Входящее) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	"""" КАК ОтправительАдрес,
		|	"""" КАК ОтправительКонтакт,
		|	"""" КАК ОтправительПредставление,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	ЭлектронноеПисьмоВходящее.Предмет,
	|	ЭлектронноеПисьмоВходящее.Текст,
	|	ЭлектронноеПисьмоВходящее.ТекстHTML,
	|	ЭлектронноеПисьмоВходящее.ТипТекста,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись,
	|	ЭлектронноеПисьмоВходящее.ПолучателиПисьма.(
	|		Адрес,
	|		Представление,
	|		Контакт
	|	),
	|	ЭлектронноеПисьмоВходящее.ПолучателиКопий.(
	|		Адрес,
	|		Представление,
	|		Контакт
	|	)
	|ИЗ";
	Если ТипЗнч(Входящее) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее";
	ИначеЕсли ТипЗнч(Входящее) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоВходящее";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|ГДЕ
	|	ЭлектронноеПисьмоВходящее.Ссылка = &Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", Входящее);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторОснования  = Выборка.ИдентификаторСообщения;
	ИдентификаторыОснований = СокрЛП(Выборка.ИдентификаторыОснований + " <" + ИдентификаторОснования + ">");
	Кодировка               = Выборка.Кодировка;
	Текст                   = Выборка.Текст;
	ТекстHTML               = Выборка.ТекстHTML;
	ТипТекста               = Выборка.ТипТекста;
	Тема                    = ДобавлятьКТеме + Выборка.Тема;
	УчетнаяЗапись           = Выборка.УчетнаяЗапись;
	
	Если ПереноситьОтправителяВПолучатели Тогда
		ДобавитьПолучателя(Выборка.ОтправительАдрес, Выборка.ОтправительПредставление, Выборка.ОтправительКонтакт);
	КонецЕсли;
	
	Если ПереноситьВсехПолучателейПисьмаВПолучатели Тогда
		ДобавитьПолучателейИзТаблицы(Выборка.ПолучателиПисьма.Выгрузить());
		ДобавитьПолучателейИзТаблицы(Выборка.ПолучателиКопий.Выгрузить());
	КонецЕсли;
	//ПолучателиПисьма.Свернуть("Адрес,Представление,Контакт");
	
	СписокПолучателейПисьма = УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(ПолучателиПисьма);
	
КонецПроцедуры

// Процедура формирует представления контактов в табличных частях получателей письма,
// а также получателей копий и скрытых копий
//
Процедура СформироватьПредставленияКонтактов() Экспорт
	
	СписокПолучателейПисьма       = УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(ПолучателиПисьма,       Ложь);
	СписокПолучателейКопий        = УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(ПолучателиКопий,        Ложь);
	СписокПолучателейСкрытыхКопий = УправлениеЭлектроннойПочтой.ПолучитьПредставлениеСпискаАдресатов(ПолучателиСкрытыхКопий, Ложь);
	
КонецПроцедуры

//
//
Функция ПолучитьАдресПочтыКонтрагента(КонтрагентСсылка)
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
				   |	ВыбранныеКонтрагенты.Ссылка
				   |ИЗ
				   |	Справочник.Контрагенты КАК ВыбранныеКонтрагенты
				   |ГДЕ
				   |	(НЕ ВыбранныеКонтрагенты.ПометкаУдаления)
				   |	И ВыбранныеКонтрагенты.Ссылка = &КонтрагентСсылка
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВыбранныеКонтрагенты.Ссылка";
				   
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	ТаблицаКонтрагентов = Запрос.Выполнить().Выгрузить();
		
	МассивКонтрагентов	= ТаблицаКонтрагентов.ВыгрузитьКолонку("Ссылка");
		
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	ТаблицаКИ = МенеджерПочтыСервер.ПолучитьКонтактнуюИнформацияОбъекта(МассивКонтрагентов, СписокТипов);
	
	ЭлектронныйАдресКлиента = "";
	
	Для Каждого СтрокаТаблицыРезультатов ИЗ ТаблицаКонтрагентов Цикл
		
		МассивСтрокКИКонтрагента = ТаблицаКИ.НайтиСтроки(Новый Структура("Ссылка", СтрокаТаблицыРезультатов.Ссылка));
		
		Для Каждого ЗначениеМассива ИЗ МассивСтрокКИКонтрагента Цикл
			Если ЗначениеМассива.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				Если ЭлектронныйАдресКлиента = "" Тогда
					ЭлектронныйАдресКлиента = ЗначениеМассива.Представление;
				Иначе
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ ЭлектронныйАдресКлиента = "" Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭлектронныйАдресКлиента;
	
КонецФункции


#КонецОбласти
